"""
в данном примере демонстрируется работа распаковки
итерируемых объектов
"""

# Тут мы попросту распаковываем наш кортеж при помощи двух переменных
lax_coordinated = (33.929223, -118.2039)
latitude, longitude = lax_coordinated
print(latitude)

# Здесь мы применили работу параллельного присваивания
a, b, *rest = range(10)
print(a, b, rest)

metro_areas = [
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
    ("Tokyo", "JP", 39.933, (35.12312, 193.2131123)),
]
def main():
    print(f"{"":15} | {"latitude":>9} | {"longitude":>9}")
    for name, _, _, (lat, lon) in metro_areas:
        print(f"{name:15} | {lat:9.4f} | {lon:9.4f}")

if __name__ == "__main__":
    main()